cloud/jupyterhub1/README.md
```mermaid
C4Container
title Container diagram explaining the architecture using JupyterHub

Person(user, User, "Users of the jupyter notebook", $tags="v1.0")
Container_Boundary(c1, "Azure Services") {
    Container(jupyterhub, "JupyterHub", "Python, Jupyter Notebook", "Multi-user version of Jupyter Notebook")
    Container(azure_ad, "Azure Active Directory", "Azure Service", "Manages users and groups")
    Rel(jupyterhub, azure_ad, "Uses", "SAML")
    Container(jupyternotebook, "Jupyter Notebook", "Python, Jupyter Notebook", "Data analysis tool")
    Rel(jupyterhub, jupyternotebook, "Creates", "")
}

Rel(user, jupyternotebook, "Uses", "HTTP")

```
